{"index":{"_id":"1"}}
{"title": "Nine Line", "Description": "https://www.bigcommerce.com/blog/product-video-marketing-examples/ - No one said your product videos needed to be serious. This video combines the brands humor with its niche product line. And, it does it in under 30 seconds, without a single word said.", "url": "https://youtu.be/hIV0ZLnWwxM"}
{"index":{"_id":"2"}}
{"title": "Man Crates", "Description": "https://www.bigcommerce.com/blog/product-video-marketing-examples/ - The voice alone is entertaining, but that isn’t why this product video makes the best of the best list. This video showcases both the brand spirit as well as what a consumer can expect to get in the box, and from the opening experience.  It does all of this in under 30 seconds.", "url": "https://youtu.be/tj3-boydrI0"}
{"index":{"_id":"3"}}
{"title": "Native Union", "Description": "https://www.bigcommerce.com/blog/product-video-marketing-examples/ - Technology product videos are often some of the best. You can thank Apple’s legendary advertising for that. Of course, this video will show you where Apple could have used a little more innovation.  Native Union tells a beautiful story of convenience for modern technology consumers –– which at this point, is near all of us.", "url": "https://youtu.be/b-mJBr4kGSs"}
{"index":{"_id":"4"}}
{"title": "Raspberry Pi", "Description": "https://www.bigcommerce.com/blog/product-video-marketing-examples/ - Never underestimate the power of transparency and and relatability. And, know your audience! This video nails both, with the founder giving a personal story behind why he started the company, and speaking directly to people to like him, or parents of kids like he used to be. This video pulls heavily on the nostalgic heartstrings –– and reminds how technology is truly changing the world for the better.", "url": "https://youtu.be/jFoA4u4x2uk"}
{"index":{"_id":"5"}}
{"title": "Training Mask", "Description": "https://www.bigcommerce.com/blog/product-video-marketing-examples/ - With some products, it is essential to show the item in action. This video is simple, but it gets the point across, especially to prospective buyers. This is a niche product for a niche audience, one dedicated to training and betterment, an audience that wakes up before the sun to train before work –– and do it all over again, for a single moment of ultimate glory, and hundreds of smaller ones along the way.", "url": "https://youtu.be/zO4x6mvNK2s"}
{"index":{"_id":"6"}}
{"title": "Kelty", "Description": "https://www.bigcommerce.com/blog/product-video-marketing-examples/ - This product video combines a product description as well as a how to for set up. It’s simple in scope –– but it is everything anyone would need to decide if they wanted to buy the product. This is the definition of bringing the offline buying experience to the online world.", "url": "https://youtu.be/qexkEo8XJRE"}
{"index":{"_id":"7"}}
{"title": "NaturallyCurly", "Description": "https://www.bigcommerce.com/blog/product-video-marketing-examples/ - NaturallyCurly doubles as a media brand and an online shop. Their product videos are thus linked with content series and campaigns, meaning there are very rarely any one offs.  We chose this video because of the #HaveYouTriedThis tag, which encourages users to interact on social media. Plus, any video with an adorable child that takes less than 15 seconds to get the point across is a winner.", "url": "https://youtu.be/35D6mpqp06A"}
{"index":{"_id":"8"}}
{"title": "Glory Cycles", "Description": "https://www.bigcommerce.com/blog/product-video-marketing-examples/ - The power of music and movement is strong with this one. With sports products, it is essential consumers can see the product in action. This video accomplishes that, as well as provides a short storyline, giving the video more depth.  Also note that you can use connotations to add product details and links back to your site from the video.", "url": "https://youtu.be/hfnO0l6Jgpc"}
{"index":{"_id":"9"}}
{"title": "Marucci", "Description": "https://www.bigcommerce.com/blog/product-video-marketing-examples/ - How do you stand out from your competitor’s? If it’s with a customer-focus, then video is a great way to tell that story.  In this video, Marucci takes a jab at competitors who release new models of product every year. Instead, the spokesperson goes into detail on why this new model took years of customer feedback, research and new technological advances to turn it into a reality.  All in all, Marucci comes out the real winner here.", "url": "https://youtu.be/LlsSDv8m_SE"}
{"index":{"_id":"10"}}
{"title": "Sierra Designs", "Description": "https://www.bigcommerce.com/blog/product-video-marketing-examples/ - Consumers trust people they can relate to. Thus Sierra Designs video is perfect for speaking to a hiking and camping crowd. The designer, featured in the video, talks through everything he did to make this tent the perfect tent for an avid hiker and camper.  Think of this video as an online version of an in-store employee. He answers all the questions a consumer could possibly have –– and does so with an aire of expertise consumers are bound to trust.", "url": "https://youtu.be/lQWQPvZyaRE"}
{"index":{"_id":"11"}}
{"title": "Solo Stove", "Description": "https://www.bigcommerce.com/blog/product-video-marketing-examples/ - Not only does this video show the product in action, it also explains the brand’s positioning and gives background as to how and why the product came to life. This video perfectly combines both storytelling and product showcasing, making it perfect for use in all channels: on a product page, in paid advertising, etc.", "url": "https://youtu.be/83tuiTSBK3U"}
